In [1]:
# Import Dependencies
import pandas as pd
import numpy as np
import matplotlib
from matplotlib import style
style.use('fivethirtyeight')
import matplotlib.pyplot as plt
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect, func
import datetime as dt

In [2]:
# Upload csv

stock_data_csv = "C:/Users/Satinder Bains/Desktop/Stocks Vs Gold Allocation/Datasets/snp500.csv"
stock_data_csv

gold_data_csv = "C:/Users/Satinder Bains/Desktop/Stocks Vs Gold Allocation/Datasets/goldx.csv"
gold_data_csv

gold_extended = "C:/Users/Satinder Bains/Desktop/Stocks Vs Gold Allocation/Datasets/Gold-quandl.csv"
gold_extended

'C:/Users/Satinder Bains/Desktop/Stocks Vs Gold Allocation/Datasets/Gold-quandl.csv'

In [3]:
# The correct encoding must be used to read the CSV in pandas
gold_df = pd.read_csv(gold_data_csv, encoding='utf-8')
gold_df.head()

           Date   Price    Open    High     Low
0  Aug 01, 2018  1216.6  1223.4  1223.4  1216.2
1  Jul 31, 2018  1223.7  1220.4  1228.1  1213.0
2  Jul 30, 2018  1221.3  1222.5  1223.9  1218.1
3  Jul 27, 2018  1222.2  1223.5  1226.8  1216.7
4  Jul 26, 2018  1225.3  1227.8  1227.8  1227.8

### Cleaning Stock Data

In [4]:
# The correct encoding must be used to read the CSV in pandas
stocks_df = pd.read_csv(stock_data_csv, encoding='utf-8')
stocks_df.head()

         Date   Open   High    Low  Close  Adj Close   Volume
0  1950-01-03  16.66  16.66  16.66  16.66      16.66  1260000
1  1950-01-04  16.85  16.85  16.85  16.85      16.85  1890000
2  1950-01-05  16.93  16.93  16.93  16.93      16.93  2550000
3  1950-01-06  16.98  16.98  16.98  16.98      16.98  2010000
4  1950-01-09  17.08  17.08  17.08  17.08      17.08  2520000

In [5]:
# Check Datatypes
stocks_df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [6]:
# Count Columns
stocks_df.count()

Date         17543
Open         17543
High         17543
Low          17543
Close        17543
Adj Close    17543
Volume       17543
dtype: int64

In [7]:
# Delete extraneous column
del stocks_df['Volume']
del stocks_df['Adj Close']
stocks_df.head()

         Date   Open   High    Low  Close
0  1950-01-03  16.66  16.66  16.66  16.66
1  1950-01-04  16.85  16.85  16.85  16.85
2  1950-01-05  16.93  16.93  16.93  16.93
3  1950-01-06  16.98  16.98  16.98  16.98
4  1950-01-09  17.08  17.08  17.08  17.08

In [8]:
# Find the Date
# Loc and Iloc also allow for conditional statments to filter rows of data
# using Loc on the logic test above only returns rows where the result is True
only_billys = stocks_df.loc[stocks_df["Date"] == "1980-01-01", :]
print(only_billys)

Empty DataFrame
Columns: [Date, Open, High, Low, Close]
Index: []

In [9]:
#FormatDatesProperly
newFormat = pd.to_datetime(stocks_df['Date'])

In [10]:
dataformat = stocks_df.set_index('Date')
dataformat.head()

             Open   High    Low  Close
Date
1950-01-03  16.66  16.66  16.66  16.66
1950-01-04  16.85  16.85  16.85  16.85
1950-01-05  16.93  16.93  16.93  16.93
1950-01-06  16.98  16.98  16.98  16.98
1950-01-09  17.08  17.08  17.08  17.08

In [11]:
# Delete extraneous column
del stocks_df['Date']
stocks_df.head()

    Open   High    Low  Close
0  16.66  16.66  16.66  16.66
1  16.85  16.85  16.85  16.85
2  16.93  16.93  16.93  16.93
3  16.98  16.98  16.98  16.98
4  17.08  17.08  17.08  17.08

In [12]:
#Concat datasets
stocks_df = pd.concat([stocks_df, newFormat], axis=1)
stocks_df.head()

    Open   High    Low  Close       Date
0  16.66  16.66  16.66  16.66 1950-01-03
1  16.85  16.85  16.85  16.85 1950-01-04
2  16.93  16.93  16.93  16.93 1950-01-05
3  16.98  16.98  16.98  16.98 1950-01-06
4  17.08  17.08  17.08  17.08 1950-01-09

In [13]:
dataformat = stocks_df.set_index('Date')
dataformat.head()

             Open   High    Low  Close
Date
1950-01-03  16.66  16.66  16.66  16.66
1950-01-04  16.85  16.85  16.85  16.85
1950-01-05  16.93  16.93  16.93  16.93
1950-01-06  16.98  16.98  16.98  16.98
1950-01-09  17.08  17.08  17.08  17.08

# Gold Cleaning

## Part I

In [14]:
# The correct encoding must be used to read the CSV in pandas
gold_extend = pd.read_csv(gold_extended, encoding='utf-8')
gold_extend.head()

         Date  USD (AM)  USD (PM)  GBP (AM)  GBP (PM)  EURO (AM)  EURO (PM)
0  2017-10-24   1278.30   1276.45    970.36    970.48    1087.32    1085.62
1  2017-10-23   1275.25   1274.90    967.79    966.37    1085.62    1085.07
2  2017-10-20   1280.25   1281.20    974.27    973.20    1084.76    1086.97
3  2017-10-19   1283.40   1286.40    975.64    975.35    1087.42    1085.98
4  2017-10-18   1280.65   1280.20    972.53    973.08    1090.47    1088.55

In [15]:
#Reverse order so lowest dates show first
aux = gold_extend.iloc[::-1]
aux.head()

,Date,USD (AM),USD (PM),GBP (AM),GBP (PM),EURO (AM),EURO (PM)
12590,1968-01-02,35.18,NaN,14.641,NaN,NaN,NaN
12589,1968-01-03,35.16,NaN,14.617,NaN,NaN,NaN
12588,1968-01-04,35.14,NaN,14.603,NaN,NaN,NaN
12587,1968-01-05,35.14,NaN,14.597,NaN,NaN,NaN
12586,1968-01-08,35.14,NaN,14.586,NaN,NaN,NaN

In [16]:
aux.fillna

<bound method DataFrame.fillna of              Date  USD (AM)  USD (PM)  GBP (AM)  GBP (PM)  EURO (AM)  \
12590  1968-01-02     35.18       NaN    14.641       NaN        NaN
12589  1968-01-03     35.16       NaN    14.617       NaN        NaN
12588  1968-01-04     35.14       NaN    14.603       NaN        NaN
12587  1968-01-05     35.14       NaN    14.597       NaN        NaN
12586  1968-01-08     35.14       NaN    14.586       NaN        NaN
12585  1968-01-09     35.14       NaN    14.576       NaN        NaN
12584  1968-01-10     35.15       NaN    14.576       NaN        NaN
12583  1968-01-11     35.17       NaN    14.596       NaN        NaN
12582  1968-01-12     35.18       NaN    14.607       NaN        NaN
12581  1968-01-15     35.18       NaN    14.597       NaN        NaN
12580  1968-01-16     35.19       NaN    14.596       NaN        NaN
12579  1968-01-17     35.20       NaN    14.613       NaN        NaN
12578  1968-01-18     35.20       NaN    14.608       NaN        NaN
12577  1968-01-19     35.19       NaN    14.610       NaN        NaN
12576  1968-01-22     35.19       NaN    14.606       NaN        NaN
12575  1968-01-23     35.19       NaN    14.607       NaN        NaN
12574  1968-01-24     35.20       NaN    14.603       NaN        NaN
12573  1968-01-25     35.20       NaN    14.604       NaN        NaN
12572  1968-01-26     35.20       NaN    14.604       NaN        NaN
12571  1968-01-29     35.19       NaN    14.600       NaN        NaN
12570  1968-01-30     35.19       NaN    14.593       NaN        NaN
12569  1968-01-31     35.20       NaN    14.592       NaN        NaN
12568  1968-02-01     35.20       NaN    14.594       NaN        NaN
12567  1968-02-02     35.20       NaN    14.595       NaN        NaN
12566  1968-02-05     35.19       NaN    14.594       NaN        NaN
12565  1968-02-06     35.19       NaN    14.597       NaN        NaN
12564  1968-02-07     35.20       NaN    14.593       NaN        NaN
12563  1968-02-08     35.19       NaN    14.600       NaN        NaN
12562  1968-02-09     35.20       NaN    14.602       NaN        NaN
12561  1968-02-12     35.19       NaN    14.598       NaN        NaN
...           ...       ...       ...       ...       ...        ...
29     2017-09-13   1332.25   1327.55  1003.850   1002.17    1112.43
28     2017-09-14   1323.00   1324.55  1002.440    991.56    1111.58
27     2017-09-15   1325.00   1322.85   977.320    973.88    1109.16
26     2017-09-18   1314.40   1312.10   970.160    967.41    1100.68
25     2017-09-19   1308.45   1309.60   969.300    969.50    1091.25
24     2017-09-20   1314.90   1311.30   970.530    967.35    1094.79
23     2017-09-21   1297.35   1292.10   960.560    956.15    1089.00
22     2017-09-22   1297.00   1294.80   956.150    958.80    1082.09
21     2017-09-25   1295.50   1293.30   957.890    956.52    1089.26
20     2017-09-26   1306.90   1300.05   969.590    967.76    1105.38
19     2017-09-27   1291.30   1282.55   963.830    958.19    1099.54
18     2017-09-28   1284.30   1283.35   961.040    955.71    1091.40
17     2017-09-29   1286.95   1283.10   963.150    960.02    1090.82
16     2017-10-02   1273.10   1273.70   956.480    960.24    1084.55
15     2017-10-03   1270.70   1271.25   959.000    959.29    1081.87
14     2017-10-04   1275.55   1274.25   960.870    960.66    1085.11
13     2017-10-05   1278.40   1274.50   969.280    970.28    1086.51
12     2017-10-06   1268.20   1261.80   970.430    967.93    1083.93
11     2017-10-09   1282.15   1278.75   976.230    972.23    1092.01
10     2017-10-10   1289.60   1291.40   977.770    978.88    1094.61
9      2017-10-11   1290.20   1289.25   978.620    976.35    1091.90
8      2017-10-12   1294.45   1290.25   977.960    981.75    1092.26
7      2017-10-13   1293.90   1299.60   972.880    975.74    1093.73
6      2017-10-16   1305.15   1303.30   981.080    981.25    1107.03
5      2017-10-17   1289.70   1284.75   973.470    975.38    1097.02
4      2017-10-18   1280.65   1280.20   972.530    973.08    1090.47
3      2017-10-19   1283.40   1286.40   975.640    975.35    1087.42
2      2017-10-20   1280.25   1281.20   974.270    973.20    1084.76
1      2017-10-23   1275.25   1274.90   967.790    966.37    1085.62
0      2017-10-24   1278.30   1276.45   970.360    970.48    1087.32

       EURO (PM)
12590        NaN
12589        NaN
12588        NaN
12587        NaN
12586        NaN
12585        NaN
12584        NaN
12583        NaN
12582        NaN
12581        NaN
12580        NaN
12579        NaN
12578        NaN
12577        NaN
12576        NaN
12575        NaN
12574        NaN
12573        NaN
12572        NaN
12571        NaN
12570        NaN
12569        NaN
12568        NaN
12567        NaN
12566        NaN
12565        NaN
12564        NaN
12563        NaN
12562        NaN
12561        NaN
...          ...
29       1112.22
28       1114.61
27       1105.37
26       1096.65
25       1092.86
24       1092.71
23       1083.81
22       1081.55
21       1088.57
20       1103.09
19       1094.14
18       1088.02
17       1087.43
16       1084.81
15       1081.33
14       1084.13
13       1087.28
12       1078.59
11       1090.01
10       1094.07
9        1087.61
8        1090.52
7        1095.43
6        1104.16
5        1094.48
4        1088.55
3        1085.98
2        1086.97
1        1085.07
0        1085.62

[12591 rows x 7 columns]>

In [17]:
#FormatDatesProperly
auDate = pd.to_datetime(aux['Date'])
auDate.head()

12590   1968-01-02
12589   1968-01-03
12588   1968-01-04
12587   1968-01-05
12586   1968-01-08
Name: Date, dtype: datetime64[ns]

In [18]:
#Delete Object "Date"
del aux['Date']

In [19]:
# Add Date Format to Dataframe
#if you want to specify the order of the column, you can use insert
#here, we are inserting at index 1 (so should be second col in dataframe)
#here is the simplist way to add the new column
auDate  = pd.concat([aux, auDate], axis=1)
auDate.head()

       USD (AM)  USD (PM)  GBP (AM)  GBP (PM)  EURO (AM)  EURO (PM)       Date
12590     35.18       NaN    14.641       NaN        NaN        NaN 1968-01-02
12589     35.16       NaN    14.617       NaN        NaN        NaN 1968-01-03
12588     35.14       NaN    14.603       NaN        NaN        NaN 1968-01-04
12587     35.14       NaN    14.597       NaN        NaN        NaN 1968-01-05
12586     35.14       NaN    14.586       NaN        NaN        NaN 1968-01-08

In [20]:
auDate.dtypes

USD (AM)            float64
USD (PM)            float64
GBP (AM)            float64
GBP (PM)            float64
EURO (AM)           float64
EURO (PM)           float64
Date         datetime64[ns]
dtype: object

In [21]:
indexAU = auDate.set_index('Date')
indexAU.head()

            USD (AM)  USD (PM)  GBP (AM)  GBP (PM)  EURO (AM)  EURO (PM)
Date
1968-01-02     35.18       NaN    14.641       NaN        NaN        NaN
1968-01-03     35.16       NaN    14.617       NaN        NaN        NaN
1968-01-04     35.14       NaN    14.603       NaN        NaN        NaN
1968-01-05     35.14       NaN    14.597       NaN        NaN        NaN
1968-01-08     35.14       NaN    14.586       NaN        NaN        NaN

## Part II

In [22]:
gold_df.head()

           Date   Price    Open    High     Low
0  Aug 01, 2018  1216.6  1223.4  1223.4  1216.2
1  Jul 31, 2018  1223.7  1220.4  1228.1  1213.0
2  Jul 30, 2018  1221.3  1222.5  1223.9  1218.1
3  Jul 27, 2018  1222.2  1223.5  1226.8  1216.7
4  Jul 26, 2018  1225.3  1227.8  1227.8  1227.8

In [23]:
# Check Datatype
gold_df.dtypes

Date      object
Price    float64
Open     float64
High     float64
Low      float64
dtype: object

In [24]:
#FormatDatesProperly
newFormatGold = pd.to_datetime(gold_df['Date'])
newFormatGold.head()

0   2018-08-01
1   2018-07-31
2   2018-07-30
3   2018-07-27
4   2018-07-26
Name: Date, dtype: datetime64[ns]

In [25]:
newFormatGold.dtype

dtype('<M8[ns]')

In [26]:
del gold_df['Date']

In [27]:
# Add Date Format to Dataframe
#if you want to specify the order of the column, you can use insert
#here, we are inserting at index 1 (so should be second col in dataframe)
#here is the simplist way to add the new column
au_ya  = pd.concat([gold_df, newFormatGold], axis=1)
au_ya.head()

    Price    Open    High     Low       Date
0  1216.6  1223.4  1223.4  1216.2 2018-08-01
1  1223.7  1220.4  1228.1  1213.0 2018-07-31
2  1221.3  1222.5  1223.9  1218.1 2018-07-30
3  1222.2  1223.5  1226.8  1216.7 2018-07-27
4  1225.3  1227.8  1227.8  1227.8 2018-07-26

In [28]:
#Reverse order so lowest dates show first
au_ya = au_ya.iloc[::-1]
au_ya.head()

      Price    Open   High     Low       Date
9770  515.5  517.00  517.0  513.00 1979-12-27
9769  517.8  516.00  517.8  510.40 1979-12-28
9768  533.6  527.88  534.5  527.88 1979-12-31
9767  575.5  562.50  577.0  558.00 1980-01-02
9766  625.0  627.00  640.0  603.00 1980-01-03

In [29]:
au_ya.dtypes

Price           float64
Open            float64
High            float64
Low             float64
Date     datetime64[ns]
dtype: object

In [30]:
gold_final = au_ya.set_index('Date')
gold_final.head()

            Price    Open   High     Low
Date
1979-12-27  515.5  517.00  517.0  513.00
1979-12-28  517.8  516.00  517.8  510.40
1979-12-31  533.6  527.88  534.5  527.88
1980-01-02  575.5  562.50  577.0  558.00
1980-01-03  625.0  627.00  640.0  603.00

# MERGEDASET

In [31]:
#Merge Gold Dataset
mergeAU = pd.merge(indexAU, gold_final, on="Date", how="outer")
mergeAU.head()

,USD (AM),USD (PM),GBP (AM),GBP (PM),EURO (AM),EURO (PM),Price,Open,High,Low
Date,,,,,,,,,,
1968-01-02,35.18,NaN,14.641,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1968-01-03,35.16,NaN,14.617,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1968-01-04,35.14,NaN,14.603,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1968-01-05,35.14,NaN,14.597,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1968-01-08,35.14,NaN,14.586,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [32]:
#Merge datasets
merge_table = pd.merge(mergeAU, dataformat, on="Date", how='outer')
merge_table.head()

,USD (AM),USD (PM),GBP (AM),GBP (PM),EURO (AM),EURO (PM),Price,Open_x,High_x,Low_x,Open_y,High_y,Low_y,Close
Date,,,,,,,,,,,,,,
1968-01-02,35.18,NaN,14.641,NaN,NaN,NaN,NaN,NaN,NaN,NaN,96.470001,97.330002,95.309998,96.110001
1968-01-03,35.16,NaN,14.617,NaN,NaN,NaN,NaN,NaN,NaN,NaN,96.110001,96.949997,95.040001,95.669998
1968-01-04,35.14,NaN,14.603,NaN,NaN,NaN,NaN,NaN,NaN,NaN,95.669998,96.230003,94.309998,95.360001
1968-01-05,35.14,NaN,14.597,NaN,NaN,NaN,NaN,NaN,NaN,NaN,95.360001,96.660004,94.970001,95.940002
1968-01-08,35.14,NaN,14.586,NaN,NaN,NaN,NaN,NaN,NaN,NaN,95.940002,97.400002,95.540001,96.620003

In [33]:
# Using .rename(columns={}) in order to rename columns
renamed_df = merge_table.rename(columns={"High_y":"SP.High", "Low_y":"SP.Low", "Price":"AU.Price",
                                        "Open_x":"AU.Open", "High_x":"AU.High", "Low_x":"AU.Low", 'Close':'SP.Price',
                                        'Open_y':'SP.Open', 'USD (AM)':'Gold.Price', 'USD (PM)':'Gold.Close'})
renamed_df.head()

,Gold.Price,Gold.Close,GBP (AM),GBP (PM),EURO (AM),EURO (PM),AU.Price,AU.Open,AU.High,AU.Low,SP.Open,SP.High,SP.Low,SP.Price
Date,,,,,,,,,,,,,,
1968-01-02,35.18,NaN,14.641,NaN,NaN,NaN,NaN,NaN,NaN,NaN,96.470001,97.330002,95.309998,96.110001
1968-01-03,35.16,NaN,14.617,NaN,NaN,NaN,NaN,NaN,NaN,NaN,96.110001,96.949997,95.040001,95.669998
1968-01-04,35.14,NaN,14.603,NaN,NaN,NaN,NaN,NaN,NaN,NaN,95.669998,96.230003,94.309998,95.360001
1968-01-05,35.14,NaN,14.597,NaN,NaN,NaN,NaN,NaN,NaN,NaN,95.360001,96.660004,94.970001,95.940002
1968-01-08,35.14,NaN,14.586,NaN,NaN,NaN,NaN,NaN,NaN,NaN,95.940002,97.400002,95.540001,96.620003

In [34]:
#Fill price of Gold.Price with Au.Price updated to end of 79
test1 = renamed_df['AU.Price'].fillna(renamed_df['Gold.Price'])
test1.head()

Date
1968-01-02    35.18
1968-01-03    35.16
1968-01-04    35.14
1968-01-05    35.14
1968-01-08    35.14
Name: AU.Price, dtype: float64

In [35]:
#Fill price of Gold.Price with Au.Price updated to end of 79
test2 = renamed_df['Gold.Price'].fillna(renamed_df['AU.Price'])
test2.head()

Date
1968-01-02    35.18
1968-01-03    35.16
1968-01-04    35.14
1968-01-05    35.14
1968-01-08    35.14
Name: Gold.Price, dtype: float64

In [36]:
renamed_df['AU.Price'] = renamed_df['AU.Price'].fillna(value=renamed_df['Gold.Price'])
renamed_df.head(3050)

,Gold.Price,Gold.Close,GBP (AM),GBP (PM),EURO (AM),EURO (PM),AU.Price,AU.Open,AU.High,AU.Low,SP.Open,SP.High,SP.Low,SP.Price
Date,,,,,,,,,,,,,,
1968-01-02,35.18,NaN,14.641,NaN,NaN,NaN,35.18,NaN,NaN,NaN,96.470001,97.330002,95.309998,96.110001
1968-01-03,35.16,NaN,14.617,NaN,NaN,NaN,35.16,NaN,NaN,NaN,96.110001,96.949997,95.040001,95.669998
1968-01-04,35.14,NaN,14.603,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.669998,96.230003,94.309998,95.360001
1968-01-05,35.14,NaN,14.597,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.360001,96.660004,94.970001,95.940002
1968-01-08,35.14,NaN,14.586,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.940002,97.400002,95.540001,96.620003
1968-01-09,35.14,NaN,14.576,NaN,NaN,NaN,35.14,NaN,NaN,NaN,96.620003,97.839996,95.889999,96.500000
1968-01-10,35.15,NaN,14.576,NaN,NaN,NaN,35.15,NaN,NaN,NaN,96.500000,97.260002,95.660004,96.519997
1968-01-11,35.17,NaN,14.596,NaN,NaN,NaN,35.17,NaN,NaN,NaN,96.519997,97.820000,95.879997,96.620003
1968-01-12,35.18,NaN,14.607,NaN,NaN,NaN,35.18,NaN,NaN,NaN,96.620003,97.440002,95.870003,96.720001
1968-01-15,35.18,NaN,14.597,NaN,NaN,NaN,35.18,NaN,NaN,NaN,96.720001,97.459999,95.849998,96.419998
1968-01-16,35.19,NaN,14.596,NaN,NaN,NaN,35.19,NaN,NaN,NaN,96.419998,96.910004,95.320000,95.820000
1968-01-17,35.20,NaN,14.613,NaN,NaN,NaN,35.20,NaN,NaN,NaN,95.820000,96.410004,94.779999,95.639999
1968-01-18,35.20,NaN,14.608,NaN,NaN,NaN,35.20,NaN,NaN,NaN,95.639999,96.660004,95.010002,95.559998
1968-01-19,35.19,NaN,14.610,NaN,NaN,NaN,35.19,NaN,NaN,NaN,95.559998,96.220001,94.599998,95.239998
1968-01-22,35.19,NaN,14.606,NaN,NaN,NaN,35.19,NaN,NaN,NaN,95.239998,95.400002,93.550003,94.029999
1968-01-23,35.19,NaN,14.607,NaN,NaN,NaN,35.19,NaN,NaN,NaN,94.029999,94.660004,92.879997,93.660004
1968-01-24,35.20,NaN,14.603,NaN,NaN,NaN,35.20,NaN,NaN,NaN,93.660004,94.120003,92.449997,93.169998
1968-01-25,35.20,NaN,14.604,NaN,NaN,NaN,35.20,NaN,NaN,NaN,93.169998,94.110001,91.959999,93.300003
1968-01-26,35.20,NaN,14.604,NaN,NaN,NaN,35.20,NaN,NaN,NaN,93.300003,94.339996,92.769997,93.449997
1968-01-29,35.19,NaN,14.600,NaN,NaN,NaN,35.19,NaN,NaN,NaN,93.449997,94.379997,92.709999,93.349998
1968-01-30,35.19,NaN,14.593,NaN,NaN,NaN,35.19,NaN,NaN,NaN,93.349998,93.709999,92.180000,92.889999
1968-01-31,35.20,NaN,14.592,NaN,NaN,NaN,35.20,NaN,NaN,NaN,92.889999,93.260002,91.269997,92.239998
1968-02-01,35.20,NaN,14.594,NaN,NaN,NaN,35.20,NaN,NaN,NaN,92.239998,93.139999,91.570000,92.559998
1968-02-02,35.20,NaN,14.595,NaN,NaN,NaN,35.20,NaN,NaN,NaN,92.559998,93.440002,91.690002,92.269997
1968-02-05,35.19,NaN,14.594,NaN,NaN,NaN,35.19,NaN,NaN,NaN,92.269997,92.720001,91.239998,91.870003
1968-02-06,35.19,NaN,14.597,NaN,NaN,NaN,35.19,NaN,NaN,NaN,91.870003,92.519997,91.150002,91.900002
1968-02-07,35.20,NaN,14.593,NaN,NaN,NaN,35.20,NaN,NaN,NaN,91.900002,92.739998,91.480003,92.059998
1968-02-08,35.19,NaN,14.600,NaN,NaN,NaN,35.19,NaN,NaN,NaN,92.059998,92.400002,90.599998,90.900002
1968-02-09,35.20,NaN,14.602,NaN,NaN,NaN,35.20,NaN,NaN,NaN,90.900002,91.000000,89.230003,89.860001
1968-02-12,35.19,NaN,14.598,NaN,NaN,NaN,35.19,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1979-12-10,431.35,431.15,198.504,198.778,NaN,NaN,431.35,NaN,NaN,NaN,107.519997,108.269997,106.650002,107.669998
1979-12-11,442.75,445.50,202.511,203.750,NaN,NaN,442.75,NaN,NaN,NaN,107.669998,108.580002,106.790001,107.489998
1979-12-12,449.75,446.25,204.293,203.053,NaN,NaN,449.75,NaN,NaN,NaN,107.489998,108.320000,106.779999,107.519997
1979-12-13,458.75,458.80,208.428,208.073,NaN,NaN,458.75,NaN,NaN,NaN,107.519997,108.290001,106.680000,107.669998
1979-12-14,459.50,456.80,209.054,208.176,NaN,NaN,459.50,NaN,NaN,NaN,107.669998,109.489998,107.370003,108.919998
1979-12-17,460.60,469.50,209.221,213.409,NaN,NaN,460.60,NaN,NaN,NaN,108.919998,110.330002,108.360001,109.330002
1979-12-18,473.50,477.75,215.286,217.238,NaN,NaN,473.50,NaN,NaN,NaN,109.330002,109.830002,107.830002,108.300003
1979-12-19,494.00,488.50,224.240,221.622,NaN,NaN,494.00,NaN,NaN,NaN,108.300003,108.790001,107.019997,108.199997
1979-12-20,477.25,471.50,216.735,214.172,NaN,NaN,477.25,NaN,NaN,NaN,108.199997,109.239998,107.400002,108.260002
1979-12-21,474.90,473.10,216.208,215.241,NaN,NaN,474.90,NaN,NaN,NaN,108.260002,108.760002,106.989998,107.589996
1979-12-24,485.90,NaN,220.463,NaN,NaN,NaN,485.90,NaN,NaN,NaN,107.589996,108.080002,106.800003,107.660004
1979-12-27,508.75,NaN,228.806,NaN,NaN,NaN,515.50,517.00,517.0,513.00,107.779999,108.500000,107.139999,107.959999
1979-12-28,515.00,512.00,230.528,229.391,NaN,NaN,517.80,516.00,517.8,510.40,107.959999,108.610001,107.160004,107.839996
1979-12-31,524.00,NaN,235.189,NaN,NaN,NaN,533.60,527.88,534.5,527.88,107.839996,108.529999,107.260002,107.940002
1980-01-02,559.00,559.50,251.123,250.841,NaN,NaN,575.50,562.50,577.0,558.00,107.940002,108.430000,105.290001,105.760002
1980-01-03,632.00,634.00,281.577,282.468,NaN,NaN,625.00,627.00,640.0,603.00,105.760002,106.080002,103.260002,105.220001
1980-01-04,596.00,588.00,266.285,262.770,NaN,NaN,603.60,609.50,621.0,573.00,105.220001,107.080002,105.089996,106.519997
1980-01-07,634.00,633.50,281.653,280.062,NaN,NaN,627.00,629.00,635.0,611.00,106.519997,107.800003,105.800003,106.809998
1980-01-08,615.75,610.00,273.060,270.270,NaN,NaN,602.50,611.50,619.0,600.00,106.809998,109.290001,106.290001,108.949997
1980-01-09,599.25,607.20,265.237,267.725,NaN,NaN,599.00,602.00,613.0,595.00,108.949997,111.089996,108.410004,109.050003
1980-01-10,608.25,602.85,268.484,266.783,NaN,NaN,598.50,602.00,602.0,592.00,109.050003,110.860001,108.470001,109.889999
1980-01-11,610.00,623.00,269.732,275.969,NaN,NaN,646.00,617.00,651.0,615.00,109.889999,111.160004,108.889999,109.919998
1980-01-14,647.75,660.00,285.982,290.685,NaN,NaN,671.00,672.00,672.0,650.00,109.919998,111.440002,109.339996,110.379997
1980-01-15,682.00,684.00,297.882,299.213,NaN,NaN,712.50,684.50,715.0,675.00,110.379997,111.930000,109.449997,111.139999
1980-01-16,765.00,760.00,335.674,333.480,NaN,NaN,744.00,770.00,770.0,738.00,111.139999,112.900002,110.379997,111.050003
1980-01-17,728.25,750.00,322.591,329.815,NaN,NaN,802.00,722.00,820.0,715.00,111.050003,112.010002,109.809998,110.699997
1980-01-18,825.50,835.00,361.823,365.347,NaN,NaN,812.00,830.00,850.0,805.00,110.699997,111.739998,109.879997,111.070000
1980-01-21,843.00,850.00,367.753,371.066,NaN,NaN,825.50,875.00,875.0,812.00,111.070000,112.900002,110.660004,112.099998
1980-01-22,763.00,737.50,334.546,323.820,NaN,NaN,682.00,740.00,758.0,679.00,112.099998,113.099998,110.919998,111.510002
1980-01-23,650.00,695.00,286.029,305.025,NaN,NaN,660.00,651.00,740.0,650.00,111.510002,113.930000,110.930000,113.440002

In [37]:
final = renamed_df.reset_index()
final.head()

,Date,Gold.Price,Gold.Close,GBP (AM),GBP (PM),EURO (AM),EURO (PM),AU.Price,AU.Open,AU.High,AU.Low,SP.Open,SP.High,SP.Low,SP.Price
0,1968-01-02,35.18,NaN,14.641,NaN,NaN,NaN,35.18,NaN,NaN,NaN,96.470001,97.330002,95.309998,96.110001
1,1968-01-03,35.16,NaN,14.617,NaN,NaN,NaN,35.16,NaN,NaN,NaN,96.110001,96.949997,95.040001,95.669998
2,1968-01-04,35.14,NaN,14.603,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.669998,96.230003,94.309998,95.360001
3,1968-01-05,35.14,NaN,14.597,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.360001,96.660004,94.970001,95.940002
4,1968-01-08,35.14,NaN,14.586,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.940002,97.400002,95.540001,96.620003

In [38]:
final.count()

Date          17860
Gold.Price    12590
Gold.Close    12456
GBP (AM)      12580
GBP (PM)      12445
EURO (AM)      4754
EURO (PM)      4719
AU.Price      12988
AU.Open        9771
AU.High        9771
AU.Low         9771
SP.Open       17543
SP.High       17543
SP.Low        17543
SP.Price      17543
dtype: int64

In [39]:
#final['Date1'] = final['Date'].dt.strftime('%m/%d/%Y')
#print (final)

final['DATE'] = final['Date'].apply(lambda x: x.strftime('%Y-%m-%d'))
final.head()

,Date,Gold.Price,Gold.Close,GBP (AM),GBP (PM),EURO (AM),EURO (PM),AU.Price,AU.Open,AU.High,AU.Low,SP.Open,SP.High,SP.Low,SP.Price,DATE
0,1968-01-02,35.18,NaN,14.641,NaN,NaN,NaN,35.18,NaN,NaN,NaN,96.470001,97.330002,95.309998,96.110001,1968-01-02
1,1968-01-03,35.16,NaN,14.617,NaN,NaN,NaN,35.16,NaN,NaN,NaN,96.110001,96.949997,95.040001,95.669998,1968-01-03
2,1968-01-04,35.14,NaN,14.603,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.669998,96.230003,94.309998,95.360001,1968-01-04
3,1968-01-05,35.14,NaN,14.597,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.360001,96.660004,94.970001,95.940002,1968-01-05
4,1968-01-08,35.14,NaN,14.586,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.940002,97.400002,95.540001,96.620003,1968-01-08

In [40]:
#final['Date1'] = final['Date'].dt.strftime('%m/%d/%Y')
#final.head()

In [41]:
date_format = pd.to_datetime(final['DATE'])
date_format.head()

0   1968-01-02
1   1968-01-03
2   1968-01-04
3   1968-01-05
4   1968-01-08
Name: DATE, dtype: datetime64[ns]

In [42]:
del final['DATE']
#del final['Date']

In [43]:
final_format  = pd.concat([final, date_format], axis=1)
final_format.head()

,Date,Gold.Price,Gold.Close,GBP (AM),GBP (PM),EURO (AM),EURO (PM),AU.Price,AU.Open,AU.High,AU.Low,SP.Open,SP.High,SP.Low,SP.Price,DATE
0,1968-01-02,35.18,NaN,14.641,NaN,NaN,NaN,35.18,NaN,NaN,NaN,96.470001,97.330002,95.309998,96.110001,1968-01-02
1,1968-01-03,35.16,NaN,14.617,NaN,NaN,NaN,35.16,NaN,NaN,NaN,96.110001,96.949997,95.040001,95.669998,1968-01-03
2,1968-01-04,35.14,NaN,14.603,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.669998,96.230003,94.309998,95.360001,1968-01-04
3,1968-01-05,35.14,NaN,14.597,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.360001,96.660004,94.970001,95.940002,1968-01-05
4,1968-01-08,35.14,NaN,14.586,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.940002,97.400002,95.540001,96.620003,1968-01-08

In [44]:
final_format.dtypes

Date          datetime64[ns]
Gold.Price           float64
Gold.Close           float64
GBP (AM)             float64
GBP (PM)             float64
EURO (AM)            float64
EURO (PM)            float64
AU.Price             float64
AU.Open              float64
AU.High              float64
AU.Low               float64
SP.Open              float64
SP.High              float64
SP.Low               float64
SP.Price             float64
DATE          datetime64[ns]
dtype: object

In [45]:
final_format['Year'] = final_format['DATE'].dt.year

final_format['Month'] = final_format['DATE'].dt.month

final_format['Day'] = final_format['DATE'].dt.day

In [46]:
# Remove two columns name is 'C' and 'D' 
final_format = final_format.drop(['DATE'], axis = 1)

In [47]:
practiceloc = final_format.set_index('Date')
practiceloc.head()

,Gold.Price,Gold.Close,GBP (AM),GBP (PM),EURO (AM),EURO (PM),AU.Price,AU.Open,AU.High,AU.Low,SP.Open,SP.High,SP.Low,SP.Price,Year,Month,Day
Date,,,,,,,,,,,,,,,,,
1968-01-02,35.18,NaN,14.641,NaN,NaN,NaN,35.18,NaN,NaN,NaN,96.470001,97.330002,95.309998,96.110001,1968,1,2
1968-01-03,35.16,NaN,14.617,NaN,NaN,NaN,35.16,NaN,NaN,NaN,96.110001,96.949997,95.040001,95.669998,1968,1,3
1968-01-04,35.14,NaN,14.603,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.669998,96.230003,94.309998,95.360001,1968,1,4
1968-01-05,35.14,NaN,14.597,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.360001,96.660004,94.970001,95.940002,1968,1,5
1968-01-08,35.14,NaN,14.586,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.940002,97.400002,95.540001,96.620003,1968,1,8

In [48]:
#delete extraneous columns
droptop = practiceloc.drop(['Gold.Price', 'Gold.Close'], axis = 1)
droptop.head()

,GBP (AM),GBP (PM),EURO (AM),EURO (PM),AU.Price,AU.Open,AU.High,AU.Low,SP.Open,SP.High,SP.Low,SP.Price,Year,Month,Day
Date,,,,,,,,,,,,,,,
1968-01-02,14.641,NaN,NaN,NaN,35.18,NaN,NaN,NaN,96.470001,97.330002,95.309998,96.110001,1968,1,2
1968-01-03,14.617,NaN,NaN,NaN,35.16,NaN,NaN,NaN,96.110001,96.949997,95.040001,95.669998,1968,1,3
1968-01-04,14.603,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.669998,96.230003,94.309998,95.360001,1968,1,4
1968-01-05,14.597,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.360001,96.660004,94.970001,95.940002,1968,1,5
1968-01-08,14.586,NaN,NaN,NaN,35.14,NaN,NaN,NaN,95.940002,97.400002,95.540001,96.620003,1968,1,8

In [49]:
droptop = droptop[[
    'SP.Price','SP.Open','SP.Low','SP.High',
    'AU.Price','AU.Open','AU.Low','AU.High',
    'GBP (AM)','GBP (PM)','EURO (AM)','EURO (PM)',
    'Month','Day','Year']]
droptop.head()

,SP.Price,SP.Open,SP.Low,SP.High,AU.Price,AU.Open,AU.Low,AU.High,GBP (AM),GBP (PM),EURO (AM),EURO (PM),Month,Day,Year
Date,,,,,,,,,,,,,,,
1968-01-02,96.110001,96.470001,95.309998,97.330002,35.18,NaN,NaN,NaN,14.641,NaN,NaN,NaN,1,2,1968
1968-01-03,95.669998,96.110001,95.040001,96.949997,35.16,NaN,NaN,NaN,14.617,NaN,NaN,NaN,1,3,1968
1968-01-04,95.360001,95.669998,94.309998,96.230003,35.14,NaN,NaN,NaN,14.603,NaN,NaN,NaN,1,4,1968
1968-01-05,95.940002,95.360001,94.970001,96.660004,35.14,NaN,NaN,NaN,14.597,NaN,NaN,NaN,1,5,1968
1968-01-08,96.620003,95.940002,95.540001,97.400002,35.14,NaN,NaN,NaN,14.586,NaN,NaN,NaN,1,8,1968

In [50]:
UncleSam = droptop[[
    'SP.Price','SP.Open','SP.Low','SP.High',
    'AU.Price','AU.Open','AU.Low','AU.High',
    'Month','Day','Year']]
UncleSam.head()

,SP.Price,SP.Open,SP.Low,SP.High,AU.Price,AU.Open,AU.Low,AU.High,Month,Day,Year
Date,,,,,,,,,,,
1968-01-02,96.110001,96.470001,95.309998,97.330002,35.18,NaN,NaN,NaN,1,2,1968
1968-01-03,95.669998,96.110001,95.040001,96.949997,35.16,NaN,NaN,NaN,1,3,1968
1968-01-04,95.360001,95.669998,94.309998,96.230003,35.14,NaN,NaN,NaN,1,4,1968
1968-01-05,95.940002,95.360001,94.970001,96.660004,35.14,NaN,NaN,NaN,1,5,1968
1968-01-08,96.620003,95.940002,95.540001,97.400002,35.14,NaN,NaN,NaN,1,8,1968

In [51]:
# Grab the data contained within the "Berry" row and the "Phone Number" column
#simran = practiceloc.loc["1987-08-17", "AU.Price"]
#print("Using Loc: " + simran)

In [52]:
#Store time interval periods in dictionary
#one_yr = []
#two_yr = []
#five_yr = []
#ten_yr = []

#years = final_format["Year"]
#months = final_format['Month']
#days = final_format['Day']
#gold_price = final_format['AU.Price']
#sp_price = final_format['SP.Close']

#Loop to grab data between time intervals and store them

#def my():
#    for year in final_format:
#        if(year==1979):
#            print(year)
#        if(year!=1979):
#            pass

In [53]:
close = final_format[['Year', 'AU.Price', 'SP.Close']]
close.head()

KeyError: "['SP.Close'] not in index"

In [ ]:
# Calculate the date one year from the last date in data set.
prev_year = dt.date(2012, 8, 23) - dt.timedelta(days=365)